jansampol/esp32c6-MicroRos/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_WIFI_SSID="MyNewHotspot"
CONFIG_ESP_WIFI_PASSWORD="12345678"
CONFIG_MICRO_ROS_AGENT_IP="192.168.50.96"
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=n
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=n
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_USE_DYN_BUFFERS=y
CONFIG_IEEE802154_CCA_THRESHOLD=-75
CONFIG_LWIP_DHCP_OPTIONS_LEN=69
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_MBEDTLS_THREADING_C=y
CONFIG_MBEDTLS_THREADING_ALT=n
CONFIG_MBEDTLS_THREADING_PTHREAD=y
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=n
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=n
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_VFS_SUPPORT_TERMIOS=n
